7Ji/esp8266-temp-monitor-and-pc-reset/src/main.cpp
static NtpSyncer ntpSyncer = {};

struct SensorValue {
  COMPCONST int const lenBuffer = 38; /* extreme 18446744073709551615,255.255,255.255\n */
  COMPCONST int const lenBufferShort = 16; /* extreme 255.255,255.255\0 */

  int8_t tempInt;
  uint8_t tempDot;
  uint8_t humidInt;
  uint8_t humidDot;

  /* buffer should be at least lenBuffer */
  bool intoStr(uint64_t const unixSeconds, char *const buffer, size_t &len) const {
    int const r = snprintf(buffer, lenBuffer, "%" PRIu64 ",%" PRId8 ".%" PRIu8 ",%" PRIu8 ".%" PRIu8 "\n", unixSeconds, tempInt, tempDot, humidInt, humidDot);

    if (r < 0) {
      serverSendError(StringFormatFailure);
      return false;
    } else if (r >= lenBuffer) {
      serverSendError(StringWouldTruncate);
      return false;
    } else {
      len = r;
      return true;
    }
  }
};

static_assert(sizeof(struct SensorValue) == 4, "SensorValue should have a size of 4");

struct SensorRecord {
  uint16_t timestamp; /* second offset from slice unixOffset */
  SensorValue value;
};

static_assert(sizeof(struct SensorRecord) == 6, "SensorRecord should have a size of 6");

struct SensorSlice {
  COMPCONST uint32_t const Magic = 0x82660C05;
  COMPCONST uint16_t const MaxRecords = 40;
  COMPCONST uint16_t const MaxRecordsSub1 = MaxRecords - 1;
  COMPCONST uint16_t const CountChecksum32 = (sizeof(uint64_t) + MaxRecords * sizeof(SensorRecord)) / sizeof(uint32_t);
  COMPCONST uint16_t const CountAll32 = CountChecksum32 + 2;

  uint32_t magic = Magic;
  uint32_t checksum;
  uint64_t unixOffset;
  SensorRecord records[MaxRecords];

  uint32_t actualChecksum() const {
    uint32_t const *const raw = reinterpret_cast<uint32_t const *>(&unixOffset);
    uint32_t x = *raw;
    uint16_t i;
    for (i = 1; i < CountChecksum32; ++i) {
      x ^= raw[i];
    }
    return x;
  }

  void shift() {
    uint16_t recordID, recordIDNext, diff;

    diff = records[1].timestamp;
    unixOffset += diff;

    for (recordID = 0; recordID < MaxRecordsSub1;) {
      recordIDNext = recordID + 1;
      records[recordID] = records[recordIDNext];
      records[recordID].timestamp -= diff;
      recordID = recordIDNext;
    }
  }

  bool valid() {
    uint32_t expectedChecksum;

    if (magic != SensorSlice::Magic) {
      Serial.printf("Slice magic not right (recorded %08" PRIx32 " != expected %08" PRIx32 ")\n", magic, SensorSlice::Magic);
      return false;
    }
    expectedChecksum = actualChecksum();
    if (checksum != expectedChecksum) {
      Serial.printf("Slice Checksum mismatch (recorded %08" PRIx32 " != expected %08" PRIx32")\n", checksum, expectedChecksum);
      return false;
    }
    return true;
  }
};

struct SensorHistory {
  COMPCONST uint32_t const MinInterval = 2000;
  COMPCONST uint8_t const MaxHistoryL0 = 1 << 5; /* 2s * 32, even secondly, for about a minute */

  COMPCONST uint8_t const RingMaskL0 = MaxHistoryL0 - 1;

  COMPCONST uint32_t const FlashAddrStart = 0x100000;
  COMPCONST uint32_t const FlashAddrEnd = 0x3FB000;
  COMPCONST int const FlashSectExp = 12;
  COMPCONST uint16_t const FlashSectSize = 1 << FlashSectExp; /* 4096 */
  COMPCONST uint16_t const FlashSectStart = FlashAddrStart / FlashSectSize;
  COMPCONST uint16_t const FlashSectEnd = FlashAddrEnd / FlashSectSize;
  COMPCONST uint16_t const FlashSectTotal = FlashSectEnd - FlashSectStart;
  COMPCONST int const FlashPageExp = 8;
  COMPCONST int const FlashSectPageFactor = FlashSectExp - FlashPageExp;
  COMPCONST uint8_t const FlashSectPageCount = 1 << FlashSectPageFactor;
  COMPCONST uint16_t const FlashSectWordCount = FlashSectSize / sizeof(uint32_t);
  COMPCONST uint16_t const FlashPageSize = 1 << FlashPageExp; /* 256 */
  static_assert(sizeof(struct SensorSlice) == FlashPageSize, "SensorSlice should have the same size as page");
  COMPCONST uint16_t const FlashPageInSectMask = FlashSectPageCount - 1;
  COMPCONST uint16_t const FlashPageStart = FlashAddrStart / FlashPageSize;
  COMPCONST uint16_t const FlashPageEnd = FlashAddrEnd / FlashPageSize;
  COMPCONST uint16_t const FlashPageTotal = FlashPageEnd - FlashPageStart;
  COMPCONST uint16_t const FlashPageTotalSubSect = FlashPageTotal - FlashSectPageCount;
  COMPCONST uint8_t const FlashPageWordCount = FlashPageSize / sizeof(uint32_t);

  union {
    SensorSlice sliceL1 = {.magic = SensorSlice::Magic};
    uint32_t sliceL1Raw[sizeof(SensorSlice) / sizeof(uint32_t)];
  };
  union {
    SensorSlice sliceL2; /* about minutely, flush to flash every 30 minutes */
    uint32_t sliceL2Raw[sizeof(SensorSlice) / sizeof(uint32_t)];
  };
  SensorValue valuesL0[MaxHistoryL0];
  uint64_t unixSecondsL0[MaxHistoryL0];
  uint32_t millisLast = 0;
  uint16_t countL2 = 0; /* page */
  uint16_t headL2 = 0; /* sector */
  uint16_t countL1 = 0;
  uint8_t headL0 = 0;
  uint8_t countL0 = 0;

  uint16_t firstPage() const {
    return headL2 << FlashSectPageFactor;
  }

  uint16_t slicePage(uint16_t const sliceID) const {
    return (firstPage() + sliceID) % FlashPageTotal;
  }

  SensorValue &first() {
    if (countL2 > 0 && fetchPage(firstPage())) {
      return sliceL2.records[0].value;
    } else if (countL1 > 0) {
      return sliceL1.records[0].value;
    } else {
      return valuesL0[headL0];
    }
  }

  SensorValue &first(uint64_t &unixSeconds) {
    if (countL2 > 0 && fetchPage(firstPage())) {
      unixSeconds = sliceL2.unixOffset + sliceL2.records[0].timestamp;
      return sliceL2.records[0].value;
    } else if (countL1 > 0) {
      unixSeconds = sliceL1.unixOffset + sliceL1.records[0].timestamp;
      return sliceL1.records[0].value;
    } else {
      unixSeconds = unixSecondsL0[headL0];
      return valuesL0[headL0];
    }
  }

  SensorValue &last() {
    return valuesL0[(headL0 + countL0 - 1) & RingMaskL0];
  }

  SensorValue &last(uint64_t &unixSeconds) {
    uint8_t const recordID = (headL0 + countL0 - 1) & RingMaskL0;

    unixSeconds = unixSecondsL0[recordID];
    return valuesL0[recordID];
  }

  bool erase(uint16_t const sectorID) {
    uint16_t const flashSectorID = sectorID + FlashSectStart;
    SpiFlashOpResult opResult;

    Serial.printf("Erasing sector %" PRIu16 "/f%" PRIu16 "\n", sectorID, flashSectorID);
    opResult = spi_flash_erase_sector(flashSectorID);
    if (opResult != SPI_FLASH_RESULT_OK) {
      Serial.printf("Failed to erase sector %" PRIu16 "/f%" PRIu16 ", op result %d\n", sectorID, flashSectorID, opResult);
      return false;
    }
    return true;
  }

  bool writeL1(uint16_t const pageID) {
    uint16_t const flashPageID = pageID + FlashPageStart;
    SpiFlashOpResult opResult;

