7Ji/esp8266-temp-monitor-and-pc-reset/src/main.cpp
    if (countL0 == MaxHistoryL0) {
      if (!headL0) {
        if (countL1 == SensorSlice::MaxRecords) {
          flushL1L2();
        }
        appendL1(valuesL0[0], unixSecondsL0[0]);
      }
      current = headL0;
      headL0 = (headL0 + 1) & RingMaskL0;
    } else {
      current = (headL0 + countL0++) & RingMaskL0;
    }

    value = valuesL0 + current;

    millisLast = millisCurrent;
    unixSeconds = ntpSyncer.unixOffset + upTimer.upSeconds(millisCurrent);
    unixSecondsL0[current] = unixSeconds;
    value->humidInt = dht.data[0];
    value->humidDot = dht.data[1];
    value->tempInt =  static_cast<int8_t>(dht.data[2]);
    value->tempDot = dht.data[3];
  }

  void firstFetchAppend(uint32_t const millisCurrent) {
    dht.begin();
    fetchAppend(millisCurrent);
  }

  void maybeFetchAppend(uint32_t const millisCurrent) {
    if (millisCurrent - millisLast >= MinInterval) {
      fetchAppend(millisCurrent);
    }
  }
};

static SensorHistory history = {};

void httpHandleLast() {
  int i, r, offset, remain;
  int const countArgs = server.args();
  SensorValue &value = history.last();
  char buffer[SensorValue::lenBufferShort];

  if (countArgs > 0) {
    offset = 0, remain = SensorValue::lenBufferShort;
    buffer[1] = '\0';
    for (i = 0; i < countArgs; ++i) {
      String const &argName = server.argName(i);
      if (argName.startsWith("temp")) {
        r = snprintf(buffer + offset, remain, ",%" PRId8 ".%" PRIu8, value.tempInt, value.tempDot);
      } else if (argName.startsWith("humid")) {
        r = snprintf(buffer + offset, remain, ",%" PRIu8 ".%" PRIu8, value.humidInt, value.humidDot);
      } else {
        continue;
      }
      if (r < 0) {
        serverSendError(StringFormatFailure);
        return;
      }
      if (r >= remain) {
        serverSendError(StringWouldTruncate);
        return;
      }
      offset += r;
      remain -= r;
    }
    server.send(200, "text/plain", buffer + 1, offset - 1);
  } else {
    r = snprintf(buffer, SensorValue::lenBufferShort, "%" PRId8 ".%" PRIu8 ",%" PRIu8 ".%" PRIu8 "", value.tempInt, value.tempDot, value.humidInt, value.humidDot);
    if (r < 0) {
      serverSendError(StringFormatFailure);
      return;
    }
    if (r >= SensorValue::lenBufferShort) {
      serverSendError(StringWouldTruncate);
    }
    server.send(200, "text/plain", buffer, r);
  }
}

void httpHandleNotFound() {
  server.send_P(404, "text/plain", ErrorNotFound, sizeof(ErrorNotFound) - 1);
}

bool serverIsAuthorized() {
  static String const AuthExpected = String("Bearer " PRIVATE_PC_AUTH);
  static String const HeaderAuthorization = String("Authorization");

  if (!server.hasHeader(HeaderAuthorization)) {
    return false;
  }

  return server.header(HeaderAuthorization) == AuthExpected;
}

void pulseButton(uint8_t const pin) {
  digitalWrite(pin, HIGH);
  delay(250);
  digitalWrite(pin, LOW);
}

void httpHandlePcPower() {
  if (!serverIsAuthorized()) {
    httpHandleNotFound();
    return;
  }

  pulseButton(PcPinPower);
  server.send_P(200, "text/plain", PcPowerOk, sizeof(PcPowerOk) - 1);
}

void httpHandlePcReset() {
  if (!serverIsAuthorized()) {
    httpHandleNotFound();
    return;
  }

  pulseButton(PcPinReset);
  server.send_P(200, "text/plain", PcResetOk, sizeof(PcResetOk) - 1);
}

#ifdef PRIVATE_ALLOW_CROSS
void serverSendHeadersForRaw() {
  server.sendHeader("Access-Control-Allow-Origin", "*");
  server.sendHeader("Cache-Control", "no-store");
}
#endif

struct RawAllSender {
  COMPCONST size_t const lenBuffer = 1024;
  COMPCONST size_t const lenMax = lenBuffer - SensorValue::lenBuffer;

  char buffer[lenBuffer];
  size_t len;
  size_t offset = 0;

  RawAllSender() {
    server.setContentLength(CONTENT_LENGTH_UNKNOWN);
#ifdef PRIVATE_ALLOW_CROSS
    serverSendHeadersForRaw();
#endif
    server.send(200, "text/plain", "", 0);
  }

  void sendValue(uint64_t const unixSeconds, SensorValue const &value) {
    if (value.intoStr(unixSeconds, buffer + offset, len)) {
      if ((offset += len) >= lenMax) {
        server.sendContent(buffer, offset);
        offset = 0;
      }
    }
  }

  void sendRingRecords(SensorValue const *values, uint64_t const *unixSeconds, uint8_t const head, uint8_t const count) {
    uint8_t i;

    for (i = head; i < count; ++i) {
      sendValue(unixSeconds[i], values[i]);
    }
    for (i = 0; i < head; ++i) {
      sendValue(unixSeconds[i], values[i]);
    }
  }

  void sendSlice(SensorSlice const &slice, uint16_t const count = SensorSlice::MaxRecords) {
    uint64_t const unixOffset = slice.unixOffset;
    SensorRecord const *record;
    uint16_t i;

    for (i = 0; i < count; ++i) {
      record = slice.records + i;
      sendValue(unixOffset + record->timestamp, record->value);
    }
  }

  void sendPage(uint16_t const pageID) {
    if (!history.fetchPage(pageID)) {
      return;
    }
    sendSlice(history.sliceL2);
  }

  void sendAll() {
    uint16_t i;

    if (history.countL2 > 0) {
      offset = history.firstPage();
      if (offset > 0) {
        for (i = offset; i < SensorHistory::FlashPageTotal; ++i) {
          sendPage(i);
        }
        offset = history.countL2 + offset - SensorHistory::FlashPageTotal;
        for (i = 0; i < offset; ++i) {
          sendPage(i);
        }
      } else {
        for (i = 0; i < history.countL2; ++i) {
          sendPage(i);
        }
      }
    }
    if (history.countL1 > 0) {
      sendSlice(history.sliceL1, history.countL1);
    }
    if (history.countL0 > 0) {
      sendRingRecords(history.valuesL0, history.unixSecondsL0, history.headL0, history.countL0);
    }

  }

  ~RawAllSender() {
    if (offset) {
      server.sendContent(buffer, offset);
    }
    server.sendContent("", 0);
  }
};

void httpHandleRawAll() {
  RawAllSender sender = {};

  sender.sendAll();
}

void httpHandleRawLast() {
  char buffer[SensorValue::lenBuffer];
  uint64_t unixSeconds;
  size_t len;

  if (history.last(unixSeconds).intoStr(unixSeconds, buffer, len)) {
#ifdef PRIVATE_ALLOW_CROSS
    serverSendHeadersForRaw();
#endif
    server.send(200, "text/plain", buffer, len);
  }
}

void httpHandleRoot() {
  server.send_P(200, "text/html; charset=utf-8", RootPage, sizeof(RootPage) - 1);
}

void setup() {
  static String const wantedSSID = String(ConfigWiFiSSID);

  bool recoverFlash = false;
  int8_t countNetworks, bestScanID;
  uint8_t i, *currentBSSID;
  int32_t bestRSSI, currentRSSI, currentChannel;
  uint32_t millisCurrent;
  String currentSSID;

  pinMode(PcPinPower, OUTPUT);
  digitalWrite(PcPinPower, LOW);
  pinMode(PcPinReset, OUTPUT);
  digitalWrite(PcPinReset, LOW);

  Serial.begin(ConfigBaudRate);
  WiFi.setHostname(ConfigHostName);
  WiFi.setAutoReconnect(true);

